---
kind: property
id: P:Autodesk.Revit.DB.Document.MullionTypes
zh: 文档、文件
source: html/ce7bf7aa-4e38-fad1-15ed-816529815dbf.htm
---
# Autodesk.Revit.DB.Document.MullionTypes Property

**中文**: 文档、文件

This property is used to retrieve all the mullion types in current system.

## Syntax (C#)
```csharp
public MullionTypeSet MullionTypes { get; }
```

## Remarks
This property returns a set of MullionType objects. These objects can be used change the type of a mullion from one type to another.